In [1]:
import pandas as pd
import csv,sqlite3
df = pd.DataFrame({'F_Name': ['Juan', 'Victoria', 'Mary','Joseph','Ethan','Hary','John','Pewds'],
                   'L_Name': ['Hou','Eldson','Wong','Mark','Huang','Poter','Deph','Di'],
                  'Age': ['23','34','43','26','32','28','41','25'], 
                  'City': ['Miami', 'Buenos Aires','Santiago','Whales','Karachi','Kolkatta','Mumbai','Han Dong'],
                  'Count': ['CN','UK','CN','US','PK','IN','IN','CN']})
print (df.dtypes)

F_Name    object
L_Name    object
Age       object
City      object
Count     object
dtype: object

In [2]:
df['Age'] = pd.to_numeric(df['Age'])

In [3]:
age_morethan_25 = df.loc[df['Age'] > 25, ['F_Name','Age','City']]

print (age_morethan_25)

     F_Name  Age          City
1  Victoria   34  Buenos Aires
2      Mary   43      Santiago
3    Joseph   26        Whales
4     Ethan   32       Karachi
5      Hary   28      Kolkatta
6      John   41        Mumbai

In [4]:
data1 = pd.read_excel("ESD.xlsx")

In [5]:
print (data1)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [6]:
print (data1.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT

In [7]:
print (data1.tail(10))

       EEID          Full Name             Job Title       Department  \
990  E01578       Anthony Hong            Sr. Manger               IT
991  E03430        Leo Herrera  Sr. Business Partner  Human Resources
992  E03058      Robert Wright   Technical Architect               IT
993  E04762  Audrey Richardson              Director               IT
994  E01148     Scarlett Kumar       Systems Analyst               IT
995  E03094       Wesley Young           Sr. Analyst        Marketing
996  E01909       Lillian Khan               Analyst          Finance
997  E04398        Oliver Yang              Director        Marketing
998  E02521        Lily Nguyen           Sr. Analyst          Finance
999  E03545        Sofia Cheng        Vice President       Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
990  Research & Development    Male      Asian   37 2010-11-29         146961
991  Research & Development    Male     Latino   48 1998-04-22          85369
992           Manufacturing    Male  Caucasian   30 2015-06-14          67489
993           Manufacturing  Female  Caucasian   46 2018-10-06         166259
994               Corporate  Female      Asian   55 2009-01-07          47032
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country      City  Exit Date
990     0.11  United States  Columbus        NaT
991     0.00         Brazil    Manaus 2004-11-27
992     0.00  United States   Chicago        NaT
993     0.17  United States   Chicago        NaT
994     0.00  United States  Columbus        NaT
995     0.00  United States  Columbus        NaT
996     0.00          China   Chengdu 2018-01-08
997     0.15  United States     Miami        NaT
998     0.00          China   Chengdu        NaT
999     0.31  United States     Miami        NaT

In [8]:
print (data1.isnull().sum())

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

In [9]:
print (data1["Country"].duplicated().sum())

997

In [10]:
print(data1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB
None

In [11]:
data1.describe()

,Age,Hire Date,Annual Salary,Bonus %,Exit Date
count,1000.000000,1000,1000.000000,1000.000000,85
mean,44.382000,2012-04-07 02:54:14.400000,113217.365000,0.088660,2016-11-02 18:04:14.117647104
min,25.000000,1992-01-09 00:00:00,40063.000000,0.000000,1994-12-18 00:00:00
25%,35.000000,2007-02-14 00:00:00,71430.250000,0.000000,2014-12-25 00:00:00
50%,45.000000,2014-02-15 12:00:00,96557.000000,0.000000,2019-05-23 00:00:00
75%,54.000000,2018-06-22 00:00:00,150782.250000,0.150000,2021-04-09 00:00:00
max,65.000000,2021-12-26 00:00:00,258498.000000,0.400000,2022-08-17 00:00:00
std,11.246981,NaN,53545.985644,0.117856,NaN

In [30]:
print (data1.columns)

Index(['EEID', 'Full Name', 'Job Title', 'Department', 'Business Unit',
       'Gender', 'Ethnicity', 'Age', 'Hire Date', 'Annual Salary', 'Bonus %',
       'Country', 'City', 'Exit Date'],
      dtype='object')

In [7]:
import pandas as pd
data2 = pd.read_csv("company1.csv")
print (data2)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [13]:
import numpy as np
print (data2["salary"].replace(np.nan,"24400.0"))

0    24400.0
1    25000.0
2    27000.0
3    20000.0
4    25000.0
5    24400.0
6    25000.0
Name: salary, dtype: object

In [11]:
print (data2["salary"].mean())

24400.0

In [24]:
print (data2.fillna( method = "bfill" ))

    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

In [3]:
import pandas as pd
full_before = pd.read_csv("company1.csv")
print (full_before.dtypes)

EEID       object
Name       object
gender     object
salary    float64
dtype: object

In [7]:
half1 = full_before[['EEID','Name','gender']]
print (half1)

    EEID      Name gender
0  EMP01    ayushi      F
1  EMP02     rohit      M
2  EMP03  pranjali    NaN
3  EMP01    ayushi      F
4  EMP05       NaN      M
5  EMP06     rohit      M
6  EMP02     rohit      M

In [8]:
half2 = full_before['salary']
print (half2)

0        NaN
1    25000.0
2    27000.0
3    20000.0
4    25000.0
5        NaN
6    25000.0
Name: salary, dtype: float64

In [10]:
full_new = half1 + half2

In [11]:
print (full_new)

  EEID Name gender   0   1   2   3   4   5   6
0  NaN  NaN    NaN NaN NaN NaN NaN NaN NaN NaN
1  NaN  NaN    NaN NaN NaN NaN NaN NaN NaN NaN
2  NaN  NaN    NaN NaN NaN NaN NaN NaN NaN NaN
3  NaN  NaN    NaN NaN NaN NaN NaN NaN NaN NaN
4  NaN  NaN    NaN NaN NaN NaN NaN NaN NaN NaN
5  NaN  NaN    NaN NaN NaN NaN NaN NaN NaN NaN
6  NaN  NaN    NaN NaN NaN NaN NaN NaN NaN NaN

In [15]:
data1 = pd.read_excel("ESD.xlsx")
print (data1)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [21]:
data1.loc[(data1["Bonus %"] == 0),"Get Bonus"] = "No Bonus"
data1.loc[(data1['Bonus %'] > 0), "Get Bonus"] = "Bonus"

In [22]:
print (data1)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date Get Bonus
0       0.15  United States    Seattle 2021-10-16     Bonus
1       0.00          China  Chongqing        NaT  No Bonus
2       0.20  United States    Chicago        NaT     Bonus
3       0.07  United States    Chicago        NaT     Bonus
4       0.00  United States    Phoenix        NaT  No Bonus
..       ...            ...        ...        ...       ...
995     0.00  United States   Columbus        NaT  No Bonus
996     0.00          China    Chengdu 2018-01-08  No Bonus
997     0.15  United States      Miami        NaT     Bonus
998     0.00          China    Chengdu        NaT  No Bonus
999     0.31  United States      Miami        NaT     Bonus

[1000 rows x 15 columns]

In [24]:
print (data1["Exit Date"].fillna( method = "bfill"))
print (data1["Exit Date"].fillna( method = "ffill"))

0     2021-10-16
1     2021-05-20
2     2021-05-20
3     2021-05-20
4     2021-05-20
         ...
995   2018-01-08
996   2018-01-08
997          NaT
998          NaT
999          NaT
Name: Exit Date, Length: 1000, dtype: datetime64[ns]
0     2021-10-16
1     2021-10-16
2     2021-10-16
3     2021-10-16
4     2021-10-16
         ...
995   2004-11-27
996   2018-01-08
997   2018-01-08
998   2018-01-08
999   2018-01-08
Name: Exit Date, Length: 1000, dtype: datetime64[ns]

In [25]:
print (data1)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date Get Bonus
0       0.15  United States    Seattle 2021-10-16     Bonus
1       0.00          China  Chongqing        NaT  No Bonus
2       0.20  United States    Chicago        NaT     Bonus
3       0.07  United States    Chicago        NaT     Bonus
4       0.00  United States    Phoenix        NaT  No Bonus
..       ...            ...        ...        ...       ...
995     0.00  United States   Columbus        NaT  No Bonus
996     0.00          China    Chengdu 2018-01-08  No Bonus
997     0.15  United States      Miami        NaT     Bonus
998     0.00          China    Chengdu        NaT  No Bonus
999     0.31  United States      Miami        NaT     Bonus

[1000 rows x 15 columns]

In [31]:
data1['Country and City'] = data1['Country'].str.title() +' ' + data1['City'].str.title()
print (data1)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date Get Bonus  \
0       0.15  United States    Seattle 2021-10-16     Bonus
1       0.00          China  Chongqing        NaT  No Bonus
2       0.20  United States    Chicago        NaT     Bonus
3       0.07  United States    Chicago        NaT     Bonus
4       0.00  United States    Phoenix        NaT  No Bonus
..       ...            ...        ...        ...       ...
995     0.00  United States   Columbus        NaT  No Bonus
996     0.00          China    Chengdu 2018-01-08  No Bonus
997     0.15  United States      Miami        NaT     Bonus
998     0.00          China    Chengdu        NaT  No Bonus
999     0.31  United States      Miami        NaT     Bonus

           Country and City
0     United States Seattle
1           China Chongqing
2     United States Chicago
3     United States Chicago
4     United States Phoenix
..                      ...
995  United States Columbus
996           China Chengdu
997     United States Miami
998           China Chengdu
999     United States Miami

[1000 rows x 16 columns]

In [10]:
import pandas as pd
data = { 'months' : ['January','Febuary','March','April','May','June','July']}
a = pd.DataFrame(data)
def extract (value):
    if len(value) == 4:
        return value
    else:
        return value [0:3]
    

a['Short_months'] = a['months'].map(extract)
print (a)

    months Short_months
0  January          Jan
1  Febuary          Feb
2    March          Mar
3    April          Apr
4      May          May
5     June         June
6     July         July

In [12]:
groupby = pd.read_excel("ESD.xlsx")
print (groupby)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [13]:
print (groupby.dtypes)

EEID                     object
Full Name                object
Job Title                object
Department               object
Business Unit            object
Gender                   object
Ethnicity                object
Age                       int64
Hire Date        datetime64[ns]
Annual Salary             int64
Bonus %                 float64
Country                  object
City                     object
Exit Date        datetime64[ns]
dtype: object

In [30]:
gp = groupby.groupby(["Age","Gender"]).agg({"Annual Salary":"min","Gender":"count"})
gp1 = groupby.groupby(["Country","Department","Gender"]).agg({"Gender":"count"})

In [31]:
print (gp)

            Annual Salary  Gender
Age Gender
25  Female          47974      13
    Male            41336       9
26  Female          55767       9
    Male            44732       8
27  Female          49011      16
...                   ...     ...
63  Male            73200       9
64  Female          55369      11
    Male            40316      12
65  Female          50341      12
    Male            55499       3

[82 rows x 2 columns]

In [32]:
print (gp1)

                                      Gender
Country       Department      Gender
Brazil        Accounting      Female       7
                              Male         3
              Engineering     Female      17
                              Male        15
              Finance         Female       9
                              Male         9
              Human Resources Female      11
                              Male         8
              IT              Female      12
                              Male        14
              Marketing       Female       6
                              Male         7
              Sales           Female      13
                              Male         8
China         Accounting      Female      10
                              Male        10
              Engineering     Female      17
                              Male        12
              Finance         Female      19
                              Male         9
              Human Resources Female      12
                              Male        13
              IT              Female      22
                              Male        28
              Marketing       Female      14
                              Male        21
              Sales           Female      15
                              Male        16
United States Accounting      Female      36
                              Male        30
              Engineering     Female      46
                              Male        51
              Finance         Female      41
                              Male        33
              Human Resources Female      41
                              Male        40
              IT              Female      85
                              Male        80
              Marketing       Female      37
                              Male        35
              Sales           Female      48
                              Male        40

In [48]:
data1 = { 'emp_id':['emp01','emp02','emp03','emp04','emp05','emp06'],'name':['hassan','john','demon','profit','mustafa','hussain'], 'age':[23,42,36,43,13,27],'salary':[23000,54000,24000,12000,52000,32000]}
data2 = { 'emp_id':['emp07','emp08','emp09','emp10','emp11','emp12'], 'salary':[23000,45000,12000,34550,35000,29000],'name':['fatima','watson','jammy','sakina','hashim','hamza'],'age':[34,12,27,41,38,28]}
d1 = pd.DataFrame(data1)
d2 = pd.DataFrame(data2)
print (pd.concat([d1,d2],ignore_index=True))

   emp_id     name  age  salary
0   emp01   hassan   23   23000
1   emp02     john   42   54000
2   emp03    demon   36   24000
3   emp04   profit   43   12000
4   emp05  mustafa   13   52000
5   emp06  hussain   27   32000
6   emp07   fatima   34   23000
7   emp08   watson   12   45000
8   emp09    jammy   27   12000
9   emp10   sakina   41   34550
10  emp11   hashim   38   35000
11  emp12    hamza   28   29000

In [56]:
data3 = { 'Fruit':['Apple','Orange','Pineapple','Papaya','Mango'], 'Price' : [12.0,13.0,18.0,25.0,5.0], 'Quantity':[5,6,12,8,14]}
d3 = pd.DataFrame(data3)
print (d3)

       Fruit  Price  Quantity
0      Apple   12.0         5
1     Orange   13.0         6
2  Pineapple   18.0        12
3     Papaya   25.0         8
4      Mango    5.0        14

In [57]:
d4 = d3.copy()
print(d4)

       Fruit  Price  Quantity
0      Apple   12.0         5
1     Orange   13.0         6
2  Pineapple   18.0        12
3     Papaya   25.0         8
4      Mango    5.0        14

In [100]:
d6.loc[0,"Price"] = 15.0
d6.loc[1,"Price"] = 10.0
d6.loc[2,"Price"] = 21.0
d6.loc[4,"Price"] = 7.0
d6.loc[0,"Quantity"] = 8
d6.loc[1,"Quantity"] = 7
d6.loc[2,"Quantity"] = 9
d6.loc[4,"Quantity"] = 11

In [93]:
print (d4)

       Fruit  Price  Quantity  Qauntity
0      Apple   15.0         8       8.0
1     Orange   10.0         7       7.0
2  Pineapple   21.0         9       9.0
3     Papaya   25.0         8      14.0
4      Mango    7.0        11      11.0

In [101]:
print (d6)

       Fruit  Price  Quantity
0      Apple   15.0         8
1     Orange   10.0         7
2  Pineapple   21.0         9
3     Papaya   25.0         8
4      Mango    7.0        11

In [104]:
print (d3.compare(d6,keep_shape=True))

  Fruit       Price       Quantity
   self other  self other     self other
0   NaN   NaN  12.0  15.0      5.0   8.0
1   NaN   NaN  13.0  10.0      6.0   7.0
2   NaN   NaN  18.0  21.0     12.0   9.0
3   NaN   NaN   NaN   NaN      NaN   NaN
4   NaN   NaN   5.0   7.0     14.0  11.0